open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
/****************************************************************************
 * board/beken/chips/bk7258/bk7258_jpeg_enc.c
 *
 * BK7258 hardware JPEG encoder, register layer only.  Register layout
 * source: bk_avdk_smp release/v3.1.1
 * ap/middleware/soc/bk7258_ap/soc/jpeg_struct.h and
 * ap/middleware/soc/bk7258_ap/hal/jpeg_ll.h; initialisation order from
 * ap/middleware/soc/common/hal/jpeg_hal.c jpeg_hal_switch_mode()'s
 * JPEG_MODE branch plus ap/middleware/driver/jpeg_enc/jpeg_driver.c
 * jpeg_init_common().
 *
 * Register map (byte offset from BK7258_JPEG_ENC_BASE):
 *   dev_id           0x00 - read-only module identity
 *   dev_version      0x04 - read-only module version
 *   global_ctrl      0x08 - bit[0] soft_reset, bit[1] clk_gate_bypass
 *   dev_status       0x0c - read-only module status
 *   eof_offset       0x10 - bit[16:31] eof_offset
 *   rx_fifo_data     0x14 - encoded-stream FIFO read port (DMA source)
 *   int_status       0x18 - bit[0] sof, bit[1] eof, bit[2] head output,
 *                            bit[3] frame error, bit[5] line clear,
 *                            bit[6] fifo_rd_finish (write-1-to-clear)
 *   byte_count_pfrm  0x1c - encoded byte count of the last frame
 *   fifo_status      0x20 - bit[26] stream_fifo_empty,
 *                            bit[27] stream_fifo_full, bit[28] is_data_set
 *   y_count          0x24 - bit[24:31] y_count
 *   byte_cnt_line    0x28 - encoded byte count of the current line
 *   int_en           0x30 - bit[0] frame_err, bit[1] head, bit[2] sof,
 *                            bit[3] eof, bit[7] line_clear
 *   cfg              0x34 - bit[1] video_byte_reverse, bit[4] jpeg_enc_en,
 *                            bit[8:15] x_pixel, bit[16] jpeg_enc_size,
 *                            bit[17] bitrate_ctrl, bit[18:19] bitrate_step,
 *                            bit[20] auto_step, bit[23] bitrate_mode,
 *                            bit[24:31] y_pixel
 *   target_byte_h    0x38 - rate-control upper bound, bytes per frame
 *   target_byte_l    0x3c - rate-control lower bound, bytes per frame
 *   quant_table      0x80 - 32 words of quantisation table
 *
 * NOTE the int_en bit order is NOT the int_status bit order: eof is
 * int_en bit[3] but int_status bit[1], sof is int_en bit[2] but
 * int_status bit[0].  Evidence: jpeg_ll_enable_end_frame_int() sets
 * int_en.eof_int_en (struct bit[3]) while
 * jpeg_ll_is_frame_end_int_triggered() tests int_status BIT(1).
 *
 * x_pixel/y_pixel are width/height divided by 8, exactly as for YUV_BUF
 * (ap/components/bk_dvp/src/bk_dvp.c dvp_camera_jpeg_config_init():
 * "jpeg_config.x_pixel = config->width / 8").
 *
 * Power/clock: this module needs the shared video-pipeline power domain
 * on and its own clock gate open, both in the system controller's
 * register space, before any of its own registers have real effect
 * (jpeg_driver.c jpeg_init_common()).  Note the JPEG clock gate is in a
 * *different* sysctrl register than YUV_BUF's: sys_hal_set_jpeg_clk_en()
 * writes cpu_device_clk_enable.jpeg_cken (sysctrl word 0x0c bit[28]),
 * whereas YUV_BUF uses reserver_reg0xd.yuv_cken (word 0x0d bit[3]).
 * There is also a reserver_reg0xd.jpeg_cken at word 0x0d bit[8] which
 * the vendor code never touches -- do not confuse the two.
 *
 * Output path: unlike YUV_BUF this module has no destination-address
 * register; the encoded bytes must be pulled out of rx_fifo_data by DMA
 * (DMA_DEV_JPEG).  See include/bk7258_jpeg_enc.h for the citations.
 *
 * BK7258 deltas worth knowing when comparing against jpeg_hal.c: on this
 * chip jpeg_ll_enable_sync_edge_dect(), jpeg_ll_enable_vsync_reverse(),
 * jpeg_ll_enable_hsync_reverse(), jpeg_ll_yuv_fml_sel() and
 * jpeg_ll_set_mclk_div() are all empty "// not support" stubs
 * (ap/middleware/soc/bk7258_ap/hal/jpeg_ll.h).  Sync polarity, sensor
 * byte order and the sensor MCLK divider are therefore programmed in
 * YUV_BUF's ctrl register, not here, and jpeg_hal_switch_mode()'s
 * vsync/hsync/sensor_fmt handling compiles to nothing on BK7258.  This
 * driver writes only the fields that really exist.
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include <nuttx/config.h>
#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>
#include <errno.h>
#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>

#include "arm_internal.h"
#include "hardware/bk7258_memorymap.h"
#include "irq.h"
#include "bk7258_jpeg_enc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define BK7258_JPEG_ENC_BASE       0x48000000u  /* SOC_JPEG_REG_BASE */

#define JPEG_REG(word_off)         (BK7258_JPEG_ENC_BASE + (word_off) * 4u)

#define JPEG_DEV_ID                      JPEG_REG(0)
#define JPEG_DEV_VERSION                 JPEG_REG(1)

#define JPEG_GLOBAL_CTRL                 JPEG_REG(2)
#define JPEG_GLOBAL_CTRL_SOFT_RESET      (1u << 0)
#define JPEG_GLOBAL_CTRL_CLK_GATE_BYPASS (1u << 1)

#define JPEG_DEV_STATUS                  JPEG_REG(3)
#define JPEG_EOF_OFFSET                  JPEG_REG(4)
#define JPEG_RX_FIFO_DATA                JPEG_REG(5)

#define JPEG_INT_STATUS                  JPEG_REG(6)
#define JPEG_INT_STATUS_SOF              (1u << 0)
#define JPEG_INT_STATUS_EOF              (1u << 1)
#define JPEG_INT_STATUS_HEAD             (1u << 2)
#define JPEG_INT_STATUS_FRAME_ERR        (1u << 3)
#define JPEG_INT_STATUS_LINE_CLEAR       (1u << 5)

/* jpeg_ll_get_interrupt_status() returns only int_status.int_status,
 * i.e. bit[0:5]; bit[6] (fifo_rd_finish) is a FIFO state flag, not an
 * event, and is deliberately left out of the acknowledge write-back.
 */

#define JPEG_INT_STATUS_MASK             0x3fu

#define JPEG_BYTE_COUNT_PFRM             JPEG_REG(7)

#define JPEG_FIFO_STATUS                 JPEG_REG(8)
#define JPEG_FIFO_STATUS_STREAM_EMPTY    (1u << 26)
#define JPEG_Y_COUNT                     JPEG_REG(9)
#define JPEG_BYTE_COUNT_LINE             JPEG_REG(10)

#define JPEG_INT_EN                      JPEG_REG(12)
#define JPEG_INT_EN_FRAME_ERR            (1u << 0)
#define JPEG_INT_EN_HEAD                 (1u << 1)
#define JPEG_INT_EN_SOF                  (1u << 2)
#define JPEG_INT_EN_EOF                  (1u << 3)
#define JPEG_INT_EN_LINE_CLEAR           (1u << 7)

