open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
/* What the reference enables for JPEG_MODE: end-of-frame only
 * (jpeg_hal_switch_mode(): "jpeg_ll_enable_end_frame_int(hal->hw)" is
 * the single int_en call in the JPEG_MODE branch).  head/sof/line_clear
 * belong to paths this driver does not implement, and frame_err is left
 * off to stay faithful to the reference -- one frame's worth of encoded
 * data is reported by EOF alone.
 */

/* Interrupts armed in JPEG mode.
 *
 * EOF is the one the driver acts on -- it is what "a frame is encoded"
 * means.  SOF and frame-error are enabled purely to be counted: without
 * them, an encoder that produces nothing is indistinguishable from one that
 * starts frames and fails to finish them, which is exactly the ambiguity the
 * first board attempt ran into (isr=0 frame=0 sof=0 could not say whether
 * the sensor stream was reaching the encoder at all).
 */

#define JPEG_INT_EN_JPEG_MODE \
  (JPEG_INT_EN_EOF | JPEG_INT_EN_SOF | JPEG_INT_EN_FRAME_ERR)

#define JPEG_CFG                         JPEG_REG(13)
#define JPEG_CFG_VIDEO_BYTE_REVERSE      (1u << 1)
#define JPEG_CFG_ENC_EN                  (1u << 4)
#define JPEG_CFG_X_PIXEL_SHIFT           8u
#define JPEG_CFG_X_PIXEL_MASK            (0xffu << JPEG_CFG_X_PIXEL_SHIFT)
#define JPEG_CFG_ENC_SIZE                (1u << 16)
#define JPEG_CFG_BITRATE_CTRL            (1u << 17)
#define JPEG_CFG_BITRATE_STEP_SHIFT      18u
#define JPEG_CFG_BITRATE_STEP_MASK       (0x3u << JPEG_CFG_BITRATE_STEP_SHIFT)
#define JPEG_CFG_AUTO_STEP               (1u << 20)
#define JPEG_CFG_BITRATE_MODE            (1u << 23)
#define JPEG_CFG_Y_PIXEL_SHIFT           24u
#define JPEG_CFG_Y_PIXEL_MASK            (0xffu << JPEG_CFG_Y_PIXEL_SHIFT)

/* jpeg_ll_set_default_bitrate_step(): "hw->cfg.bitrate_step = 3". */

#define JPEG_BITRATE_STEP_DEFAULT        3u

#define JPEG_TARGET_BYTE_H               JPEG_REG(14)
#define JPEG_TARGET_BYTE_L               JPEG_REG(15)

#define JPEG_QUANT_TABLE                 JPEG_REG(0x20)
#define JPEG_QUANT_TABLE_LEN             32u

/* Rate-control byte window per resolution band.  The 320/640/1280 bands
 * are verbatim from jpeg_hal.c's JPEG_BITRATE_{MAX,MIN}_SIZE_* macros and
 * the x_pixel switch in jpeg_hal_set_target_bitrate(); x_pixel is
 * width/8, so those band boundaries are 40/80/160/200 == 320/640/1280/1600
 * pixels wide (X_PIXEL_* in ap/include/driver/jpeg_enc_types.h).
 *
 * The 480 band has no vendor counterpart -- see
 * bk7258_jpeg_enc_set_target_bitrate() for why one is needed here and
 * where these two numbers come from.
 */

#define JPEG_BITRATE_MAX_320             (20u * 1024u)
#define JPEG_BITRATE_MIN_320             (5u * 1024u)
#define JPEG_BITRATE_MAX_480             (20u * 1024u)
#define JPEG_BITRATE_MIN_480             (5u * 1024u)
#define JPEG_BITRATE_MAX_640             (35u * 1024u)
#define JPEG_BITRATE_MIN_640             (20u * 1024u)
#define JPEG_BITRATE_MAX_1280            (50u * 1024u)
#define JPEG_BITRATE_MIN_1280            (30u * 1024u)

#ifndef CONFIG_BK7258_JPEG_BITRATE_PCT
#  define CONFIG_BK7258_JPEG_BITRATE_PCT 100
#endif

#define JPEG_X_PIXEL_320                 40u
#define JPEG_X_PIXEL_480                 60u
#define JPEG_X_PIXEL_640                 80u
#define JPEG_X_PIXEL_1280                160u
#define JPEG_X_PIXEL_1600                200u

/* Geometry limits: x_pixel/y_pixel are 8-bit cfg fields holding
 * width/8 and height/8.
 */

#define JPEG_PIXEL_BLOCK                 8u
#define JPEG_MAX_DIMENSION               (255u * JPEG_PIXEL_BLOCK)

/* System controller registers that gate the video pipeline's power and
 * this module's clock -- required before any JPEG register has real
 * effect.  Ported from jpeg_driver.c jpeg_init_common():
 *
 *   bk_pm_module_vote_power_ctrl(PM_POWER_SUB_MODULE_NAME_VIDP_JPEG_EN,
 *                               PM_POWER_MODULE_STATE_ON)
 *     -> sys_hal_video_power_en(0)
 *     -> cpu_power_sleep_wakeup.pwd_vidp = 0  (sysctrl word 0x10 bit[7],
 *        active-high power-DOWN, so clearing it powers the domain up)
 *   sys_drv_set_jpeg_clk_en(1)
 *     -> sys_hal_set_jpeg_clk_en(1)
 *     -> cpu_device_clk_enable.jpeg_cken = 1 (sysctrl word 0x0c bit[28])
 *
 * The remaining two steps of jpeg_init_common() need nothing here:
 * sys_drv_int_enable(JPEGENC_INTERRUPT_CTRL_BIT) is what this port's
 * up_enable_irq() already does (bk7258_irq.c bk7258_route_irq() writes
 * the same CPU interrupt-enable register), and sys_drv_set_jpeg_disckg()
 * is an empty stub on BK7258 (sys_hal.c sys_hal_set_jpeg_disckg() has
 * its only line commented out).
 */

#define BK7258_SYS_REG_BASE              0x44010000u
#define BK7258_SYS_REG_0X0C              (BK7258_SYS_REG_BASE + (0x0cu << 2))
#define BK7258_SYS_JPEG_CKEN             (1u << 28)

#define BK7258_SYS_REG_0X10              (BK7258_SYS_REG_BASE + (0x10u << 2))
#define BK7258_SYS_PWD_VIDP              (1u << 7)

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Quantisation table, copied verbatim (values and order) from
 * ap/middleware/soc/bk7258_ap/hal/jpeg_ll.c's static
 * jpeg_quant_table[JPEG_QUANT_TABLE_LEN], which
 * jpeg_ll_init_quant_table() writes word by word starting at
 * JPEG_R_QUANT_TABLE (jpeg_reg.h: JPEG_R_BASE + 4 * 0x20).  Words 0..15
 * are the luma table, words 16..31 the chroma table; there is no
 * quality-scaling step in the reference, the hardware gets exactly these
 * 32 words.  (jpeg_struct.h declares the array as quat_table[0x1d] = 29
 * words, which contradicts the 32 words jpeg_ll_init_quant_table()
 * actually writes; the .c is authoritative here since it is the code
 * that runs.)
 */

static const uint32_t g_jpeg_quant_table[JPEG_QUANT_TABLE_LEN] =
{
  0x07060608, 0x07080506, 0x09090707, 0x140c0a08,
  0x0b0b0c0d, 0x1312190c, 0x1a1d140f, 0x1a1d1e1f,
  0x24201c1c, 0x2220272e, 0x1c1c232c, 0x2c293728,
  0x34343130, 0x39271f34, 0x3c32383d, 0x3234332e,
  0x0c090909, 0x0d180c0b, 0x2132180d, 0x3232211c,
  0x32323232, 0x32323232, 0x32323232, 0x32323232,
  0x32323232, 0x32323232, 0x32323232, 0x32323232,
  0x32323232, 0x32323232, 0x32323232, 0x32323232
};

static bk7258_jpeg_enc_eof_cb_t g_eof_cb;
static FAR void *g_eof_cb_arg;
static uint32_t g_output_buf_addr;

