open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
/* Written by the ISR, read by task-level diagnostics. */

static volatile uint32_t g_isr_count;
static volatile uint32_t g_frame_count;
static volatile uint32_t g_sof_count;
static volatile uint32_t g_err_count;
static volatile uint32_t g_last_status;
static volatile uint32_t g_last_bytes;

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_jpeg_enc_isr
 *
 * Description:
 *   JPEG encoder interrupt handler.  Runs in interrupt context, so it
 *   MUST NOT print, block or allocate -- the sibling YUV_BUF driver's
 *   history (a printf() from its ISR starving all task-level work until
 *   the CP-side IPC heartbeat asserted; see bk7258_yuv_buf.c
 *   bk7258_yuv_buf_init()) is the reason that rule is spelled out here.
 *   Observability comes from the counters below plus
 *   bk7258_jpeg_enc_dump_status(), which task-level code calls.
 *
 *   On EOF the frame's encoded length is read from byte_count_pfrm
 *   (REG_0x7, jpeg_ll_get_frame_byte_number()) and handed to the
 *   registered callback, which therefore also runs in interrupt context.
 *
 ****************************************************************************/

static int bk7258_jpeg_enc_isr(int irq, FAR void *context, FAR void *arg)
{
  uint32_t status = getreg32(JPEG_INT_STATUS) & JPEG_INT_STATUS_MASK;
  uint32_t bytes;

  /* Write-1-to-clear: write back exactly the event bits read as set,
   * including any that are not consumed below, so an
   * enabled-but-unhandled event can never latch the interrupt line
   * permanently (jpeg_ll_clear_interrupt_status() writes the value that
   * jpeg_ll_get_interrupt_status() returned).
   */

  putreg32(status, JPEG_INT_STATUS);

  g_isr_count++;
  g_last_status = status;

  if ((status & JPEG_INT_STATUS_SOF) != 0)
    {
      g_sof_count++;
    }

  if ((status & JPEG_INT_STATUS_FRAME_ERR) != 0)
    {
      g_err_count++;
    }

  if ((status & JPEG_INT_STATUS_EOF) != 0)
    {
      bytes = getreg32(JPEG_BYTE_COUNT_PFRM);

      g_frame_count++;
      g_last_bytes = bytes;

      if (g_eof_cb != NULL)
        {
          g_eof_cb(g_eof_cb_arg, bytes);
        }
    }

  return 0;
}

/****************************************************************************
 * Name: bk7258_jpeg_enc_write_quant_table
 *
 * Description:
 *   Loads the 32-word quantisation table, mirroring
 *   jpeg_ll_init_quant_table()'s simple ascending word writes.
 *
 ****************************************************************************/

static void bk7258_jpeg_enc_write_quant_table(void)
{
  uint32_t i;

  for (i = 0; i < JPEG_QUANT_TABLE_LEN; i++)
    {
      putreg32(g_jpeg_quant_table[i], JPEG_QUANT_TABLE + i * 4u);
    }
}

/****************************************************************************
 * Name: bk7258_jpeg_enc_set_target_bitrate
 *
 * Description:
 *   Programs the rate-control byte window for the given x_pixel
 *   (= width / 8).
 *
 *   The 320/640/1280/1600 cases reproduce
 *   jpeg_hal_set_target_bitrate()'s switch exactly, including its
 *   behaviour for widths it does not name: the vendor switch matches
 *   x_pixel only against 40/80/160/200, and every other value (e.g.
 *   1920/8 = 240, or 864/8 = 108) falls into the default case, which uses
 *   the 640-wide window.  That is kept deliberately: a "wider than 1280
 *   gets the 1280 window" generalisation would be a behaviour change
 *   relative to the reference, and those byte windows have not been
 *   characterised on this board.
 *
 *   480 is the one deliberate deviation from the vendor switch.  It is
 *   this board's default capture geometry -- both the still-photo and the
 *   social-session upload paths ask for 480x480 -- and 480/8 = 60 is not
 *   one of the vendor's bands, so it used to land in the default case and
 *   be rate-controlled against the 640 window (35 KB/20 KB).  That window
 *   is wrong for this geometry in both directions, and which way it goes
 *   wrong depends on scene content:
 *
 *     - A frame that naturally encodes below the 20 KB floor (~17 KB has
 *       been measured on a low-detail scene) makes the rate control raise
 *       quality to reach a floor the geometry cannot hold, overshoot to
 *       49-65 KB and fall back, oscillating frame to frame.  That made
 *       480x480 slower than 640x480 -- 17.4-17.9 fps vs 24.4-29.2 fps --
 *       because the extra ~40 KB on every other frame still has to be
 *       copied out of the drain ring, staged and re-aligned.  It also left
 *       the size of a single still upload undefined: 17 KB or 65 KB
 *       depending on which phase it was taken in.
 *
 *     - A frame that naturally lands inside 20-35 KB (30 frames measured
 *       at 26.1-26.8 KB on a more detailed scene) sits in the window and
 *       is left alone, so the ceiling is 35 KB for a geometry whose own
 *       output is well under that.
 *
 *   The 480 band therefore reuses the vendor's 320 window (20 KB/5 KB):
 *   the low floor stops the rate control inventing quality to reach it,
 *   and the 20 KB ceiling is a bound this geometry can actually be held
 *   to.  Both effects shrink the frame, but by a scene-dependent amount,
 *   so this is a change of target rather than a fixed byte saving.  Use
 *   CONFIG_BK7258_JPEG_BITRATE_PCT to scale the band from here.
 *
 ****************************************************************************/

static void bk7258_jpeg_enc_set_target_bitrate(uint32_t x_pixel)
{
  uint32_t up_size;
  uint32_t low_size;

  switch (x_pixel)
    {
      case JPEG_X_PIXEL_320:
        up_size  = JPEG_BITRATE_MAX_320;
        low_size = JPEG_BITRATE_MIN_320;
        break;

      case JPEG_X_PIXEL_480:
        up_size  = JPEG_BITRATE_MAX_480;
        low_size = JPEG_BITRATE_MIN_480;
        break;

      case JPEG_X_PIXEL_1280:
      case JPEG_X_PIXEL_1600:
        up_size  = JPEG_BITRATE_MAX_1280;
        low_size = JPEG_BITRATE_MIN_1280;
        break;

      case JPEG_X_PIXEL_640:
      default:
        up_size  = JPEG_BITRATE_MAX_640;
        low_size = JPEG_BITRATE_MIN_640;
        break;
    }

