open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
  /* Scaled, so the frame size can be traded against everything downstream of
   * it without editing the vendor's table.
   *
   * Every byte the encoder emits is a byte the DMA moves, the EOF handler
   * copies out of the ring and the validator walks, so this is the one knob
   * that shortens all three at once.  It costs picture quality, which is why
   * 100 -- the vendor's own numbers, unchanged -- is the default.
   */

  up_size  = up_size / 100u * CONFIG_BK7258_JPEG_BITRATE_PCT;
  low_size = low_size / 100u * CONFIG_BK7258_JPEG_BITRATE_PCT;

  putreg32(up_size, JPEG_TARGET_BYTE_H);
  putreg32(low_size, JPEG_TARGET_BYTE_L);
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

int bk7258_jpeg_enc_init(void)
{
  uint32_t reg;
  uint32_t id_in_reset;
  uint32_t version_in_reset;
  uint32_t status_in_reset;

  /* Power on the video pipeline and open this module's clock gate before
   * touching any JPEG register (jpeg_init_common(); see the file
   * header for the register/bit derivation).
   */

  reg = getreg32(BK7258_SYS_REG_0X10);
  reg &= ~BK7258_SYS_PWD_VIDP;
  putreg32(reg, BK7258_SYS_REG_0X10);

  reg = getreg32(BK7258_SYS_REG_0X0C);
  reg |= BK7258_SYS_JPEG_CKEN;
  putreg32(reg, BK7258_SYS_REG_0X0C);

  printf("bk7258_jpeg_enc: init: power/clock enabled, reg0x0c=0x%08x "
         "reg0x10=0x%08x\n",
         (unsigned int)getreg32(BK7258_SYS_REG_0X0C),
         (unsigned int)getreg32(BK7258_SYS_REG_0X10));

  /* Soft reset, per jpeg_ll_init():
   *
   *   hw->global_ctrl.soft_reset = 0;
   *   hw->global_ctrl.soft_reset = 1;
   *   jpeg_ll_reset_config_to_default(hw);   // int_en = 0, ack status
   *
   * i.e. soft_reset is active-low exactly as in YUV_BUF's global_ctrl
   * (asserting reset means writing 0), and the module is left released
   * with clk_gate_bypass still 0 -- final global_ctrl == 0x1.  Note the
   * asymmetry with YUV_BUF: there clk_gate_bypass is set during init,
   * whereas the JPEG block only gets it when encoding actually starts
   * (jpeg_ll_enable_jpeg_mode() sets clk_gate_bypass and jpeg_enc_en
   * together), so it is set in bk7258_jpeg_enc_start() instead.
   *
   * The identity/status snapshots printed below are taken with the
   * reset asserted and again with it released; that pair distinguishes
   * "module dead/unclocked" from "module alive" on the board without
   * needing an oscilloscope or JTAG, which is exactly the evidence that
   * was missing during the YUV_BUF bring-up.
   */

  putreg32(0, JPEG_GLOBAL_CTRL);
  up_udelay(10);

  id_in_reset      = getreg32(JPEG_DEV_ID);
  version_in_reset = getreg32(JPEG_DEV_VERSION);
  status_in_reset  = getreg32(JPEG_DEV_STATUS);

  putreg32(JPEG_GLOBAL_CTRL_SOFT_RESET, JPEG_GLOBAL_CTRL);
  up_udelay(10);

  /* Leave the module quiet until bk7258_jpeg_enc_configure(): no
   * interrupt sources enabled, no stale status latched.
   */

  putreg32(0, JPEG_INT_EN);
  putreg32(getreg32(JPEG_INT_STATUS) & JPEG_INT_STATUS_MASK,
           JPEG_INT_STATUS);

  printf("bk7258_jpeg_enc: init: global_ctrl=0x%08x (soft_reset "
         "released, per jpeg_ll_init())\n",
         (unsigned int)getreg32(JPEG_GLOBAL_CTRL));
  printf("bk7258_jpeg_enc: init: dev_id=0x%08x->0x%08x "
         "dev_version=0x%08x->0x%08x dev_status=0x%08x->0x%08x "
         "(in-reset -> released)\n",
         (unsigned int)id_in_reset,
         (unsigned int)getreg32(JPEG_DEV_ID),
         (unsigned int)version_in_reset,
         (unsigned int)getreg32(JPEG_DEV_VERSION),
         (unsigned int)status_in_reset,
         (unsigned int)getreg32(JPEG_DEV_STATUS));

  irq_attach(BK7258_IRQ_JPEG_ENC, bk7258_jpeg_enc_isr, NULL);
  up_enable_irq(BK7258_IRQ_JPEG_ENC);

  printf("bk7258_jpeg_enc: init: complete, irq=%d attached and enabled\n",
         (int)BK7258_IRQ_JPEG_ENC);

  return 0;
}

void bk7258_jpeg_enc_uninit(void)
{
  uint32_t reg;

  bk7258_jpeg_enc_stop();

  /* jpeg_deinit_common()'s order: stop, soft-reset pulse, clear the
   * interrupt configuration, then drop the clocks.
   */

  putreg32(0, JPEG_GLOBAL_CTRL);
  up_udelay(10);
  putreg32(JPEG_GLOBAL_CTRL_SOFT_RESET, JPEG_GLOBAL_CTRL);

  putreg32(0, JPEG_INT_EN);
  putreg32(getreg32(JPEG_INT_STATUS) & JPEG_INT_STATUS_MASK,
           JPEG_INT_STATUS);

  up_disable_irq(BK7258_IRQ_JPEG_ENC);
  irq_detach(BK7258_IRQ_JPEG_ENC);

  reg = getreg32(BK7258_SYS_REG_0X0C);
  reg &= ~BK7258_SYS_JPEG_CKEN;
  putreg32(reg, BK7258_SYS_REG_0X0C);

  /* pwd_vidp is deliberately left as it is: the video-pipeline power
   * domain is shared with YUV_BUF and H264 (the vendor driver
   * reference-counts it in sys_drv_video_power_handle()), so powering it
   * down from here would silently kill a capture path this driver does
   * not own.
   */

  g_eof_cb     = NULL;
  g_eof_cb_arg = NULL;
}

int bk7258_jpeg_enc_configure(uint16_t width, uint16_t height)
{
  uint32_t x_pixel;
  uint32_t y_pixel;
  uint32_t cfg;
  irqstate_t flags;

  if (width == 0 || height == 0 ||
      (width % JPEG_PIXEL_BLOCK) != 0 || (height % JPEG_PIXEL_BLOCK) != 0 ||
      width > JPEG_MAX_DIMENSION || height > JPEG_MAX_DIMENSION)
    {
      printf("bk7258_jpeg_enc: configure: rejected %ux%u (both "
             "dimensions must be non-zero multiples of 8 and <= %u, "
             "since x_pixel/y_pixel are 8-bit fields holding size/8)\n",
             (unsigned int)width, (unsigned int)height,
             (unsigned int)JPEG_MAX_DIMENSION);
      return -EINVAL;
    }

  x_pixel = width / JPEG_PIXEL_BLOCK;
  y_pixel = height / JPEG_PIXEL_BLOCK;

  flags = enter_critical_section();
  g_isr_count   = 0;
  g_frame_count = 0;
  g_sof_count   = 0;
  g_err_count   = 0;
  g_last_status = 0;
  g_last_bytes  = 0;
  leave_critical_section(flags);

  /* jpeg_hal_switch_mode(), JPEG_MODE branch, in order:
   *
   *   jpeg_ll_clear_config()            cfg.v = 0
   *   [vsync/hsync/sensor_fmt handling: all no-ops on BK7258, see the
   *    file header]
   *   jpeg_ll_enable_end_frame_int()    int_en.eof_int_en = 1
   *   jpeg_ll_set_x_pixel()             cfg.x_pixel
   *   jpeg_ll_set_y_pixel()             cfg.y_pixel
   *   jpeg_ll_init_quant_table()        32 words at REG_0x20
   *   jpeg_hal_set_target_bitrate()     target_byte_h / target_byte_l
   *   jpeg_ll_enable_bitrate_ctrl()     cfg.bitrate_ctrl = 1
   *   jpeg_ll_set_default_bitrate_step() cfg.bitrate_step = 3
   *   jpeg_ll_enable_video_byte_reverse() cfg.video_byte_reverse = 1
   *   jpeg_ll_enable_enc_size()         cfg.jpeg_enc_size = 1
   *
   * The cfg fields are composed into one value and written once, which
   * is equivalent to the vendor's clear-then-set-each-field sequence
   * (it starts from cfg.v = 0) but does not expose the hardware to a
   * string of half-configured intermediate states.  jpeg_enc_en stays
   * 0 here: encoding is armed by bk7258_jpeg_enc_start().
   *
   * auto_step and bitrate_mode are left at 0 because the JPEG_MODE
   * branch never writes them.
   */

  putreg32(0, JPEG_CFG);

  cfg = ((x_pixel << JPEG_CFG_X_PIXEL_SHIFT) & JPEG_CFG_X_PIXEL_MASK) |
        ((y_pixel << JPEG_CFG_Y_PIXEL_SHIFT) & JPEG_CFG_Y_PIXEL_MASK) |
        JPEG_CFG_BITRATE_CTRL |
        (JPEG_BITRATE_STEP_DEFAULT << JPEG_CFG_BITRATE_STEP_SHIFT) |
        JPEG_CFG_ENC_SIZE;

  /* video_byte_reverse: carried over from the reference's JPEG_MODE
   * branch as-is.  Its semantics are the same family as the 4-byte
   * bus-to-memory reversal already measured on this board's YUV path
   * (bk7258_yuv_buf.c's yuv_fmt_sel comment: the frame buffer comes out
   * as Cr Y1 Cb Y0 for a Y Cb Y Cr bus order), so it plausibly
   * compensates for the same wiring -- but that connection is inference,
   * not measurement: this bit has NOT been independently verified on
   * this board, and if the encoder produces colour-swapped or garbage
   * output this is the first bit to toggle.
   */

  cfg |= JPEG_CFG_VIDEO_BYTE_REVERSE;

  bk7258_jpeg_enc_write_quant_table();
  bk7258_jpeg_enc_set_target_bitrate(x_pixel);

  putreg32(cfg, JPEG_CFG);

