open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
  /* Drop anything latched while the module was being programmed, then
   * enable exactly the event the encode path needs.
   */

  putreg32(getreg32(JPEG_INT_STATUS) & JPEG_INT_STATUS_MASK,
           JPEG_INT_STATUS);
  putreg32(JPEG_INT_EN_JPEG_MODE, JPEG_INT_EN);

  printf("bk7258_jpeg_enc: configure(%ux%u): x_pixel=%u y_pixel=%u\n",
         (unsigned int)width, (unsigned int)height,
         (unsigned int)x_pixel, (unsigned int)y_pixel);
  printf("bk7258_jpeg_enc: configure: global_ctrl=0x%08x cfg=0x%08x "
         "int_en=0x%08x int_status=0x%08x target_byte_h=%u "
         "target_byte_l=%u quant[0]=0x%08x quant[31]=0x%08x\n",
         (unsigned int)getreg32(JPEG_GLOBAL_CTRL),
         (unsigned int)getreg32(JPEG_CFG),
         (unsigned int)getreg32(JPEG_INT_EN),
         (unsigned int)getreg32(JPEG_INT_STATUS),
         (unsigned int)getreg32(JPEG_TARGET_BYTE_H),
         (unsigned int)getreg32(JPEG_TARGET_BYTE_L),
         (unsigned int)getreg32(JPEG_QUANT_TABLE),
         (unsigned int)getreg32(JPEG_QUANT_TABLE +
                                (JPEG_QUANT_TABLE_LEN - 1u) * 4u));

  return 0;
}

void bk7258_jpeg_enc_set_buffer(uint32_t addr)
{
  /* Records only -- there is no destination-address register on this
   * module.  The vendor's jpeg_ll_set_em_base_addr() looks like one but
   * is not: on BK7258 its whole body is
   *
   *     hw->eof_offset.v |= (0x20 << 16);
   *
   * which discards the address argument entirely and ORs a constant into
   * eof_offset[16:31] (jpeg_hal_debug.c even prints that register under
   * the label "em_base_addr", which is where the name confusion comes
   * from).  jpeg_hal_switch_mode() only calls it under "#if
   * (!CONFIG_YUV_BUF)", i.e. never in this board's configuration, where
   * YUV_BUF feeds the encoder -- so this driver does not write
   * eof_offset at all, and the meaning of that 0x20 remains unverified.
   *
   * The encoded bitstream leaves the chip's JPEG block through
   * rx_fifo_data; see bk7258_jpeg_enc_get_fifo_addr().
   */

  g_output_buf_addr = addr;
}

uint32_t bk7258_jpeg_enc_get_buffer(void)
{
  return g_output_buf_addr;
}

uint32_t bk7258_jpeg_enc_get_fifo_addr(void)
{
  return JPEG_RX_FIFO_DATA;
}

void bk7258_jpeg_enc_register_callback(bk7258_jpeg_enc_eof_cb_t cb,
                                       FAR void *arg)
{
  irqstate_t flags = enter_critical_section();

  g_eof_cb = cb;
  g_eof_cb_arg = arg;

  leave_critical_section(flags);
}

void bk7258_jpeg_enc_start(void)
{
  /* Drop anything latched while idle, then enable encoding the way
   * jpeg_ll_enable_jpeg_mode() does: clock-gate bypass first, then
   * cfg.jpeg_enc_en.  Read-modify-write on both registers, so the
   * geometry/rate-control fields configure() wrote survive untouched.
   */

  putreg32(getreg32(JPEG_INT_STATUS) & JPEG_INT_STATUS_MASK,
           JPEG_INT_STATUS);

  modifyreg32(JPEG_GLOBAL_CTRL, 0, JPEG_GLOBAL_CTRL_CLK_GATE_BYPASS);
  modifyreg32(JPEG_CFG, 0, JPEG_CFG_ENC_EN);
}

/****************************************************************************
 * Name: bk7258_jpeg_enc_soft_reset
 *
 * Description:
 *   Pulses the module's global soft reset (0 = held, 1 = released, so the
 *   pulse is 0 then 1) without touching anything else.
 *
 *   This is the recovery step for a frame the encoder gave up on.  The
 *   reference does exactly this and does NOT reprogram the encoder
 *   afterwards (bk_jpeg_enc_soft_reset() called from
 *   dvp_camera_reset_hardware_modules_handler()), so the configuration
 *   registers are expected to survive the pulse.
 *
 *   Print-free and register-only, because recovery runs from the capture
 *   path's interrupt handler.
 *
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_jpeg_enc_fifo_empty
 *
 * Description:
 *   True when the output FIFO holds no more bitstream.
 *
 *   The EOF interrupt says the encoder finished producing, not that the
 *   bitstream has been delivered: whatever is still in this FIFO has yet to
 *   be moved by the DMA.  Measured on this board, a frame examined at EOF is
 *   short by a few hundred bytes and its end-of-image marker has not arrived
 *   yet.  Callers therefore wait on this before deciding a frame's length.
 *
 *   Read-only and print-free: called from interrupt context.
 *
 ****************************************************************************/

bool bk7258_jpeg_enc_fifo_empty(void)
{
  return (getreg32(JPEG_FIFO_STATUS) &
          JPEG_FIFO_STATUS_STREAM_EMPTY) != 0;
}

void bk7258_jpeg_enc_soft_reset(void)
{
  modifyreg32(JPEG_GLOBAL_CTRL, JPEG_GLOBAL_CTRL_SOFT_RESET, 0);
  modifyreg32(JPEG_GLOBAL_CTRL, 0, JPEG_GLOBAL_CTRL_SOFT_RESET);
}

void bk7258_jpeg_enc_stop(void)
{
  /* jpeg_ll_disable_jpeg_mode(): clk_gate_bypass = 0, jpeg_enc_en = 0.
   * Nothing else is touched -- in particular int_en keeps the EOF enable
   * and cfg keeps the geometry, so a later _start() resumes without
   * reconfiguring (and no interrupt can arrive in the meantime, because
   * a stopped encoder produces no events).
   */

  modifyreg32(JPEG_CFG, JPEG_CFG_ENC_EN, 0);
  modifyreg32(JPEG_GLOBAL_CTRL, JPEG_GLOBAL_CTRL_CLK_GATE_BYPASS, 0);
}

/****************************************************************************
 * Name: bk7258_jpeg_enc_write_header
 *
 * Description:
 *   Replaces the header this block puts in front of its bitstream with a
 *   standards-conforming one, in place, without moving the entropy data.
 *
 *   Why it is needed: the block emits SOI / APP0 / SOF0 / DQT x2 / DHT x3 and
 *   then entropy data, and the AC Huffman table it writes into the stream is
 *   NOT the table it encoded with.  Measured on this board (2026-08-12): its
 *   two DC tables are byte-identical to the JPEG Annex K standard tables, its
 *   AC table is not, and it emits neither the chroma AC table nor an SOS
 *   segment at all.  libjpeg's verdict on the raw stream is "Invalid JPEG
 *   file structure: missing SOS marker"; substituting the four standard
 *   tables plus an SOS decodes to a correct picture.  Evidence and the
 *   table-by-table comparison are in docs/reference/camera.md 14.7.
 *
 *   Layout.  The caller has the block write its bitstream at buf + pad rather
 *   than at buf, which buys the room the longer header needs:
 *
 *     hardware header  SOI + APP0 + SOF0 + DQT x2 + DHT x3 + fill  ~429 B
 *     this header      SOI + SOF0 + DQT x2 + DHT x4 + SOS           605 B
 *
 *   605 > 429, so overwriting in place from buf would run into the entropy
 *   data.  With pad bytes in front there is room, and the leftover gap is
 *   absorbed by a COM (comment) segment, whose length is free.  That also
 *   makes the number of 0xFF fill bytes the block emits irrelevant -- it
 *   varies between frames, and the COM segment soaks up the difference:
 *
 *     buf[0 .. ]           SOI + SOF0 + DQT x2 + DHT x4   (fixed length)
 *     buf[.. E-15]         COM segment (>= 4 B), covering the old header
 *     buf[E-14 .. E-1]     SOS                            (14 B)
 *     buf[E ..]            entropy data, not touched
 *
 *   SOF0 and DQT are copied from what the block produced: both are correct
 *   (the geometry is right and the quantisation tables are the ones this
 *   driver programmed), and copying them saves this function from having to
 *   know them.  They are staged on the stack because the destination range
 *   overlaps the source.
 *
 *   Interrupt context safe: no printf, no allocation, no blocking.  Reads a
 *   few hundred bytes and writes ~605.
 *
 * Input Parameters:
 *   buf - the V4L2 buffer, i.e. the DMA destination minus pad
 *   pad - offset the bitstream was written at
 *
 * Returned Value:
 *   Offset of the entropy data within buf, which is also the length of the
 *   header just written.  Zero if the stream was not shaped as expected, in
 *   which case buf is left alone.
 *
 ****************************************************************************/

