open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
size_t bk7258_jpeg_enc_write_header(FAR uint8_t *buf, size_t pad)
{
  /* The four Annex K tables in DC0 / AC0 / DC1 / AC1 order, each a complete
   * segment including its FF C4 marker.  Taken from a reference encoder's
   * output rather than typed in, so the bit counts and symbol lists cannot
   * have been transcribed wrong.
   */

  static const uint8_t g_std_dht[] =
  {
    0xff, 0xc4, 0x00, 0x1f, 0x00, 0x00, 0x01, 0x05, 0x01, 0x01, 0x01, 0x01,
    0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x02,
    0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0xff, 0xc4, 0x00,
    0xb5, 0x10, 0x00, 0x02, 0x01, 0x03, 0x03, 0x02, 0x04, 0x03, 0x05, 0x05,
    0x04, 0x04, 0x00, 0x00, 0x01, 0x7d, 0x01, 0x02, 0x03, 0x00, 0x04, 0x11,
    0x05, 0x12, 0x21, 0x31, 0x41, 0x06, 0x13, 0x51, 0x61, 0x07, 0x22, 0x71,
    0x14, 0x32, 0x81, 0x91, 0xa1, 0x08, 0x23, 0x42, 0xb1, 0xc1, 0x15, 0x52,
    0xd1, 0xf0, 0x24, 0x33, 0x62, 0x72, 0x82, 0x09, 0x0a, 0x16, 0x17, 0x18,
    0x19, 0x1a, 0x25, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x34, 0x35, 0x36, 0x37,
    0x38, 0x39, 0x3a, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4a, 0x53,
    0x54, 0x55, 0x56, 0x57, 0x58, 0x59, 0x5a, 0x63, 0x64, 0x65, 0x66, 0x67,
    0x68, 0x69, 0x6a, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79, 0x7a, 0x83,
    0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8a, 0x92, 0x93, 0x94, 0x95, 0x96,
    0x97, 0x98, 0x99, 0x9a, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7, 0xa8, 0xa9,
    0xaa, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7, 0xb8, 0xb9, 0xba, 0xc2, 0xc3,
    0xc4, 0xc5, 0xc6, 0xc7, 0xc8, 0xc9, 0xca, 0xd2, 0xd3, 0xd4, 0xd5, 0xd6,
    0xd7, 0xd8, 0xd9, 0xda, 0xe1, 0xe2, 0xe3, 0xe4, 0xe5, 0xe6, 0xe7, 0xe8,
    0xe9, 0xea, 0xf1, 0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8, 0xf9, 0xfa,
    0xff, 0xc4, 0x00, 0x1f, 0x01, 0x00, 0x03, 0x01, 0x01, 0x01, 0x01, 0x01,
    0x01, 0x01, 0x01, 0x01, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x01, 0x02,
    0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0xff, 0xc4, 0x00,
    0xb5, 0x11, 0x00, 0x02, 0x01, 0x02, 0x04, 0x04, 0x03, 0x04, 0x07, 0x05,
    0x04, 0x04, 0x00, 0x01, 0x02, 0x77, 0x00, 0x01, 0x02, 0x03, 0x11, 0x04,
    0x05, 0x21, 0x31, 0x06, 0x12, 0x41, 0x51, 0x07, 0x61, 0x71, 0x13, 0x22,
    0x32, 0x81, 0x08, 0x14, 0x42, 0x91, 0xa1, 0xb1, 0xc1, 0x09, 0x23, 0x33,
    0x52, 0xf0, 0x15, 0x62, 0x72, 0xd1, 0x0a, 0x16, 0x24, 0x34, 0xe1, 0x25,
    0xf1, 0x17, 0x18, 0x19, 0x1a, 0x26, 0x27, 0x28, 0x29, 0x2a, 0x35, 0x36,
    0x37, 0x38, 0x39, 0x3a, 0x43, 0x44, 0x45, 0x46, 0x47, 0x48, 0x49, 0x4a,
    0x53, 0x54, 0x55, 0x56, 0x57, 0x58, 0x59, 0x5a, 0x63, 0x64, 0x65, 0x66,
    0x67, 0x68, 0x69, 0x6a, 0x73, 0x74, 0x75, 0x76, 0x77, 0x78, 0x79, 0x7a,
    0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0x88, 0x89, 0x8a, 0x92, 0x93, 0x94,
    0x95, 0x96, 0x97, 0x98, 0x99, 0x9a, 0xa2, 0xa3, 0xa4, 0xa5, 0xa6, 0xa7,
    0xa8, 0xa9, 0xaa, 0xb2, 0xb3, 0xb4, 0xb5, 0xb6, 0xb7, 0xb8, 0xb9, 0xba,
    0xc2, 0xc3, 0xc4, 0xc5, 0xc6, 0xc7, 0xc8, 0xc9, 0xca, 0xd2, 0xd3, 0xd4,
    0xd5, 0xd6, 0xd7, 0xd8, 0xd9, 0xda, 0xe2, 0xe3, 0xe4, 0xe5, 0xe6, 0xe7,
    0xe8, 0xe9, 0xea, 0xf2, 0xf3, 0xf4, 0xf5, 0xf6, 0xf7, 0xf8, 0xf9, 0xfa
  };

  /* Scan header: DC0/AC0 for luma, DC1/AC1 for chroma, baseline spectral
   * range.  Ns=3 matches the SOF0 this block emits.
   */

  static const uint8_t g_sos[] =
  {
    0xff, 0xda, 0x00, 0x0c, 0x03, 0x01, 0x00, 0x02, 0x11, 0x03, 0x11,
    0x00, 0x3f, 0x00
  };

  uint8_t stage[BK7258_JPEG_ENC_STAGE_MAX];
  size_t stagelen = 0;
  size_t entropy = 0;
  size_t fixed;
  size_t comlen;
  size_t pos;
  size_t i;

  if (buf == NULL)
    {
      return 0;
    }

  i = pad;

  if (buf[i] != 0xff || buf[i + 1] != 0xd8)
    {
      return 0;                    /* No SOI: not a bitstream we recognise. */
    }

  i += 2;

  /* Walk the block's own header, staging SOF0 and DQT, and stop at the first
   * thing that is not a segment -- that is where entropy data begins.
   */

  while (i + 3 < pad + BK7258_JPEG_ENC_HDR_SCAN_MAX)
    {
      uint8_t marker;
      size_t seglen;

      if (buf[i] != 0xff)
        {
          break;
        }

      while (buf[i + 1] == 0xff)
        {
          i++;
        }

      marker = buf[i + 1];

      if (marker == 0xd9)
        {
          break;                     /* End of image: no entropy data. */
        }

      /* Only a length-bearing header segment may be walked over.  "Starts
       * with FF" does not distinguish one: entropy data writes every FF as
       * FF 00, so when the block emits no SOS of its own (the 480x480 path,
       * camera.md 14.6) a picture whose first byte is FF presents an FF here
       * too.  Reading a segment length out of that entropy data put the
       * start 685 -> 17136 on the desktop fixture, and the frame still
       * decoded -- as a displaced picture with the wrong DC and chroma,
       * because every marker was nonetheless present.
       *
       * Anything not on this list ends the header, and `entropy` already
       * points at the FF that begins the picture.
       */

      if (marker != 0xc0 && marker != 0xc4 && marker != 0xdb &&
          marker != 0xda && marker != 0xdd && marker != 0xfe &&
          (marker < 0xe0 || marker > 0xef))
        {
          break;
        }

      seglen = ((size_t)buf[i + 2] << 8) | buf[i + 3];

      if (marker == 0xda)
        {
          /* The block does emit an SOS, and the entropy data begins after
           * it -- not at it.  Consume the segment and stop.
           *
           * Treating SOS as "not a segment" and breaking here reported the
           * entropy data as starting 16 bytes early, so the header the
           * application received declared its scan to begin inside the
           * block's own SOS.  Every frame then decoded to noise while
           * carrying a perfectly valid marker structure, which is why the
           * fault survived so long: SOF/DQT/DHT/SOS/EOI all check out.
           *
           * Measured on this board: the block's SOS sits at buf+870 with
           * length 12, entropy at 884, and this function returned 868.
           * Re-assembling a captured frame on the host with the payload
           * shifted by those 16 bytes was the confirmation -- three frames
           * of a static scene then agreed to within 2.8 grey levels, in the
           * same range as the software encoder (1.5-11), while every other
           * shift gave 3.6 or worse with wildly inconsistent pairs.
           */

          if (seglen >= 2)
            {
              i += 2 + seglen;
              entropy = i;
            }

          break;
        }

