open-vela/contest2026_264_VelaSightsuixingAIzhinengyanjing/board/beken/chips/bk7258/bk7258_jpeg_enc.c
      if (seglen < 2)
        {
          break;
        }

      if (marker == 0xc0 || marker == 0xdb)
        {
          if (stagelen + seglen + 2 > sizeof(stage))
            {
              return 0;
            }

          memcpy(&stage[stagelen], &buf[i], seglen + 2);
          stagelen += seglen + 2;
        }

      i += 2 + seglen;
      entropy = i;
    }

  if (entropy == 0 || stagelen == 0)
    {
      return 0;
    }

  /* The parser fallback may be before, after, or already inside the block's
   * own SOS.  Search the complete bounded raw-header window rather than only
   * forward from that fallback.  Captured failures declared entropy at
   * 820-864 instead of 884 and began with tails of the old SOS; searching
   * only forward can never see a marker that started behind the fallback.
   */

  entropy = bk7258_jpeg_find_sos_entropy(
    buf, pad, pad + BK7258_JPEG_ENC_HDR_SCAN_MAX, entropy);

  fixed = 2 + stagelen + sizeof(g_std_dht);

  if (entropy < fixed + sizeof(g_sos) + 4)
    {
      return 0;                    /* pad too small for this stream. */
    }

  comlen = entropy - sizeof(g_sos) - fixed;

  buf[0] = 0xff;
  buf[1] = 0xd8;
  pos = 2;

  memcpy(&buf[pos], stage, stagelen);
  pos += stagelen;

  memcpy(&buf[pos], g_std_dht, sizeof(g_std_dht));
  pos += sizeof(g_std_dht);

  buf[pos]     = 0xff;
  buf[pos + 1] = 0xfe;
  buf[pos + 2] = (uint8_t)((comlen - 2) >> 8);
  buf[pos + 3] = (uint8_t)((comlen - 2) & 0xff);
  pos += comlen;

  memcpy(&buf[pos], g_sos, sizeof(g_sos));

  return entropy;
}

void bk7258_jpeg_enc_get_stats(FAR struct bk7258_jpeg_enc_stats_s *stats)
{
  irqstate_t flags;

  if (stats == NULL)
    {
      return;
    }

  flags = enter_critical_section();

  stats->isr_count   = g_isr_count;
  stats->frame_count = g_frame_count;
  stats->sof_count   = g_sof_count;
  stats->err_count   = g_err_count;
  stats->last_status = g_last_status;
  stats->last_bytes  = g_last_bytes;

  leave_critical_section(flags);
}

void bk7258_jpeg_enc_dump_status(FAR const char *tag)
{
  struct bk7258_jpeg_enc_stats_s stats;

  bk7258_jpeg_enc_get_stats(&stats);

  printf("bk7258_jpeg_enc: [%s] global_ctrl=0x%08x cfg=0x%08x "
         "int_en=0x%08x int_status=0x%08x byte_count_pfrm=%u "
         "fifo_status=0x%08x y_count=0x%08x dev_id=0x%08x "
         "dev_status=0x%08x\n",
         tag,
         (unsigned int)getreg32(JPEG_GLOBAL_CTRL),
         (unsigned int)getreg32(JPEG_CFG),
         (unsigned int)getreg32(JPEG_INT_EN),
         (unsigned int)getreg32(JPEG_INT_STATUS),
         (unsigned int)getreg32(JPEG_BYTE_COUNT_PFRM),
         (unsigned int)getreg32(JPEG_FIFO_STATUS),
         (unsigned int)getreg32(JPEG_Y_COUNT),
         (unsigned int)getreg32(JPEG_DEV_ID),
         (unsigned int)getreg32(JPEG_DEV_STATUS));
  printf("bk7258_jpeg_enc: [%s] target_byte_h=%u target_byte_l=%u "
         "out_buf=0x%08x fifo_addr=0x%08x\n",
         tag,
         (unsigned int)getreg32(JPEG_TARGET_BYTE_H),
         (unsigned int)getreg32(JPEG_TARGET_BYTE_L),
         (unsigned int)g_output_buf_addr,
         (unsigned int)bk7258_jpeg_enc_get_fifo_addr());
  printf("bk7258_jpeg_enc: [%s] isr=%u frame=%u sof=%u err=%u "
         "last_status=0x%08x last_bytes=%u\n",
         tag,
         (unsigned int)stats.isr_count,
         (unsigned int)stats.frame_count,
         (unsigned int)stats.sof_count,
         (unsigned int)stats.err_count,
         (unsigned int)stats.last_status,
         (unsigned int)stats.last_bytes);
}
